usms/UC_2_UPDATE_CHANGE/Updateworklog_Request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:ticketManagementInterface_WS_LGI">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ChangeManagementServiceRequest>
         <urn:Assurance>
            <!--Optional:-->
            <urn:AssociatedForeignTicketDataList>
               <!--Zero or more repetitions:-->
               <urn:AssociatedForeignTicketData>
                  <urn:Action>updateTicket</urn:Action>
                  <!--Optional:-->
                
                 
                    <urn:USMSTicketID>CRQ000001227016</urn:USMSTicketID>

               </urn:AssociatedForeignTicketData>
            </urn:AssociatedForeignTicketDataList>
            <!--Optional:-->
            <urn:ChangeTicket>
               <!--Optional:-->
               <urn:TicketInfo>
                 
                   <urn:TicketNumber>CRQ000001227016</urn:TicketNumber>

                
                  <urn:WorkInfo>
                    
                     <urn:WorkInfoNotes>Test notes2</urn:WorkInfoNotes>
                     <!--Optional:-->
                    
                     <urn:WorkInfoSummary>Test summary</urn:WorkInfoSummary>
                     <!--Optional:-->
                     <urn:WorkInfoType>General Information</urn:WorkInfoType>
                   
                  </urn:WorkInfo>
                  <!--Optional:-->
                  
                  
                
               </urn:TicketInfo>
               <!--Optional:-->
               <urn:ChangeInfo>
                 
                   
               </urn:ChangeInfo>
            </urn:ChangeTicket>
            <!--Optional:-->
            
         </urn:Assurance>
      </urn:ChangeManagementServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>
